; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image0 - mode
	image1 - mode
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	GroundStation11 - direction
	Star1 - direction
	Star5 - direction
	Star7 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star8 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(have_image Phenomenon12 image0)
	(have_image Star13 image0)
	(have_image Phenomenon14 image1)
	(have_image Phenomenon15 image0)
	(have_image Star16 image1)
	(have_image Phenomenon17 image1)
))

)

; plan
1. (turn_to satellite0 groundstation3 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 phenomenon14 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 6
5. (take_image satellite0 phenomenon14 instrument0 image1)
   added: (have_image phenomenon14 image1)
   goals met: 1 of 6
6. (turn_to satellite0 phenomenon12 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon12 instrument0 image0)
   added: (have_image phenomenon12 image0)
   goals met: 2 of 6
8. (turn_to satellite0 phenomenon15 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 6
9. (take_image satellite0 phenomenon15 instrument0 image0)
   added: (have_image phenomenon15 image0)
   goals met: 3 of 6
10. (turn_to satellite0 phenomenon17 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon17)
   goals met: 3 of 6
11. (take_image satellite0 phenomenon17 instrument0 image1)
   added: (have_image phenomenon17 image1)
   goals met: 4 of 6
12. (turn_to satellite0 star13 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 star13)
   goals met: 4 of 6
13. (take_image satellite0 star13 instrument0 image0)
   added: (have_image star13 image0)
   goals met: 5 of 6
14. (turn_to satellite0 star16 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star16)
   goals met: 5 of 6
15. (take_image satellite0 star16 instrument0 image1)
   added: (have_image star16 image1)
   goals met: 6 of 6
